{"backend": "tensorflow", "config": {"name": "sequential_16", "layers": [{"config": {"use_bias": true, "activity_regularizer": null, "padding": "valid", "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "batch_input_shape": [null, 32, 32, 1], "kernel_size": [3, 3], "name": "conv2d_32", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "filters": 6, "trainable": true, "bias_constraint": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "dtype": "float32", "data_format": "channels_last", "trainable": true, "name": "average_pooling2d_32", "strides": [2, 2]}, "class_name": "AveragePooling2D"}, {"config": {"use_bias": true, "activity_regularizer": null, "padding": "valid", "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "name": "conv2d_33", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "filters": 16, "trainable": true, "bias_constraint": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "dtype": "float32", "data_format": "channels_last", "trainable": true, "name": "average_pooling2d_33", "strides": [2, 2]}, "class_name": "AveragePooling2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_16", "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"use_bias": true, "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_48", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "bias_regularizer": null, "units": 120, "trainable": true, "bias_constraint": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"use_bias": true, "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_49", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "bias_regularizer": null, "units": 84, "trainable": true, "bias_constraint": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"use_bias": true, "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_50", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "bias_regularizer": null, "units": 33, "trainable": true, "bias_constraint": null, "activation": "softmax"}, "class_name": "Dense"}]}, "keras_version": "2.2.4-tf", "class_name": "Sequential"}