_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_32 (Conv2D)           (None, 30, 30, 6)         60        
_________________________________________________________________
average_pooling2d_32 (Averag (None, 15, 15, 6)         0         
_________________________________________________________________
conv2d_33 (Conv2D)           (None, 13, 13, 16)        880       
_________________________________________________________________
average_pooling2d_33 (Averag (None, 6, 6, 16)          0         
_________________________________________________________________
flatten_16 (Flatten)         (None, 576)               0         
_________________________________________________________________
dense_48 (Dense)             (None, 120)               69240     
_________________________________________________________________
dense_49 (Dense)             (None, 84)                10164     
_________________________________________________________________
dense_50 (Dense)             (None, 33)                2805      
=================================================================
Total params: 83,149
Trainable params: 83,149
Non-trainable params: 0
_________________________________________________________________
