{"keras_version": "2.2.4-tf", "config": {"name": "sequential_9", "layers": [{"config": {"dilation_rate": [1, 1], "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "strides": [1, 1], "batch_input_shape": [null, 64, 64, 3], "padding": "valid", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv2d_36", "filters": 32, "activity_regularizer": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_36", "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "padding": "valid", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv2d_37", "filters": 32, "activity_regularizer": null, "dtype": "float32", "kernel_size": [3, 3], "trainable": true}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_37", "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "padding": "valid", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv2d_38", "filters": 32, "activity_regularizer": null, "dtype": "float32", "kernel_size": [3, 3], "trainable": true}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_38", "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "padding": "valid", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv2d_39", "filters": 32, "activity_regularizer": null, "dtype": "float32", "kernel_size": [3, 3], "trainable": true}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_39", "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_9", "data_format": "channels_last", "dtype": "float32", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 128, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "dense_18", "activity_regularizer": null, "dtype": "float32", "trainable": true}, "class_name": "Dense"}, {"config": {"units": 33, "activation": "softmax", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "dense_19", "activity_regularizer": null, "dtype": "float32", "trainable": true}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow"}