{"backend": "tensorflow", "keras_version": "2.2.4-tf", "class_name": "Sequential", "config": {"name": "sequential_45", "layers": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "bias_constraint": null, "activation": "relu", "trainable": true, "use_bias": true, "padding": "valid", "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_90", "kernel_regularizer": null, "batch_input_shape": [null, 64, 64, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 6}}, {"class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "name": "average_pooling2d_90", "trainable": true, "pool_size": [2, 2], "dtype": "float32", "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "valid", "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_91", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 16}}, {"class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "name": "average_pooling2d_91", "trainable": true, "pool_size": [2, 2], "dtype": "float32", "padding": "valid", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_45", "dtype": "float32", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activation": "relu", "trainable": true, "units": 120, "dtype": "float32", "name": "dense_135", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activation": "relu", "trainable": true, "units": 84, "dtype": "float32", "name": "dense_136", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activation": "softmax", "trainable": true, "units": 9, "dtype": "float32", "name": "dense_137", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activity_regularizer": null}}]}}