_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_38 (Conv2D)           (None, 30, 30, 6)         60        
_________________________________________________________________
average_pooling2d_38 (Averag (None, 15, 15, 6)         0         
_________________________________________________________________
conv2d_39 (Conv2D)           (None, 13, 13, 16)        880       
_________________________________________________________________
average_pooling2d_39 (Averag (None, 6, 6, 16)          0         
_________________________________________________________________
flatten_19 (Flatten)         (None, 576)               0         
_________________________________________________________________
dense_57 (Dense)             (None, 120)               69240     
_________________________________________________________________
dense_58 (Dense)             (None, 84)                10164     
_________________________________________________________________
dense_59 (Dense)             (None, 33)                2805      
=================================================================
Total params: 83,149
Trainable params: 83,149
Non-trainable params: 0
_________________________________________________________________
