{"backend": "tensorflow", "keras_version": "2.2.4-tf", "class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 32, 32, 1], "padding": "valid", "activation": "relu", "bias_regularizer": null, "use_bias": true, "filters": 6, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "dtype": "float32", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_18"}}, {"class_name": "AveragePooling2D", "config": {"trainable": true, "strides": [2, 2], "name": "average_pooling2d_18", "data_format": "channels_last", "dtype": "float32", "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "padding": "valid", "activation": "relu", "bias_regularizer": null, "use_bias": true, "filters": 16, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "dtype": "float32", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_19"}}, {"class_name": "AveragePooling2D", "config": {"trainable": true, "strides": [2, 2], "name": "average_pooling2d_19", "data_format": "channels_last", "dtype": "float32", "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "dtype": "float32", "name": "flatten_9", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "activation": "relu", "bias_regularizer": null, "use_bias": true, "units": 120, "bias_constraint": null, "name": "dense_27", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "activation": "relu", "bias_regularizer": null, "use_bias": true, "units": 84, "bias_constraint": null, "name": "dense_28", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "activation": "softmax", "bias_regularizer": null, "use_bias": true, "units": 33, "bias_constraint": null, "name": "dense_29", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}}}], "name": "sequential_9"}}