_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_44 (Conv2D)           (None, 62, 62, 32)        896       
_________________________________________________________________
conv2d_45 (Conv2D)           (None, 60, 60, 32)        9248      
_________________________________________________________________
max_pooling2d_42 (MaxPooling (None, 30, 30, 32)        0         
_________________________________________________________________
flatten_12 (Flatten)         (None, 28800)             0         
_________________________________________________________________
dense_24 (Dense)             (None, 128)               3686528   
_________________________________________________________________
dense_25 (Dense)             (None, 33)                4257      
=================================================================
Total params: 3,700,929
Trainable params: 3,700,929
Non-trainable params: 0
_________________________________________________________________
