{"class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_regularizer": null, "dtype": "float32", "batch_input_shape": [null, 64, 64, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activity_regularizer": null, "kernel_constraint": null, "padding": "valid", "name": "conv2d_20", "use_bias": true, "filters": 6, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3]}}, {"class_name": "AveragePooling2D", "config": {"dtype": "float32", "name": "average_pooling2d_20", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activity_regularizer": null, "kernel_constraint": null, "padding": "valid", "name": "conv2d_21", "use_bias": true, "filters": 16, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3]}}, {"class_name": "AveragePooling2D", "config": {"dtype": "float32", "name": "average_pooling2d_21", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Flatten", "config": {"dtype": "float32", "trainable": true, "data_format": "channels_last", "name": "flatten_10"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "units": 120, "name": "dense_30", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "units": 84, "name": "dense_31", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "units": 2, "name": "dense_32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "trainable": true, "activation": "softmax"}}], "name": "sequential_10"}, "backend": "tensorflow", "keras_version": "2.2.4-tf"}